#ifndef __HAL_FLASH_H__
#define __HAL_FLASH_H__


/*********************************************************************
 * INCLUDES
 */


/*********************************************************************
 * CPPMIX
 */
#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************
 * MACROS
 */
#define FLASH_MOUNT_POINT           "/spiffs"
#define FLASH_MOUNT                 (1)
#define FLASH_UNMOUNT               (0)

/*********************************************************************
* TYPEDEFS
*/


/*********************************************************************
 * CONSTANTS
 */


/*********************************************************************
 * LOCAL VARIABLES
 */


/*********************************************************************
 * GLOBAL VARIABLES
 */


/*********************************************************************
 * LOCAL FUNCTIONS
 */


/*********************************************************************
 * GLOBAL FUNCTIONS
 */
/**
 * @brief 初始化板载Flash存储
 *
 * 此函数用于挂载板载SPIFFS分区，作为无SD卡时的备用存储介质。
 */
extern void hal_flash_init(void);

/**
 * @brief 获取板载Flash存储的状态
 *
 * @return int 1:已挂载, 0:未挂载
 */
extern int hal_flash_get_status(void);

#ifdef __cplusplus
}
#endif

#endif /* __HAL_FLASH_H__ */
