#ifndef __HAL_SD_H__
#define __HAL_SD_H__


/*********************************************************************
 * INCLUDES
 */


/*********************************************************************
 * CPPMIX
 */
#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************
 * MACROS
 */
 #define MOUNT_POINT             "/sdcard"
 #define SD_MOUNT                (1)
 #define SD_UNMOUNT              (0)

/*********************************************************************
* TYPEDEFS
*/


/*********************************************************************
 * CONSTANTS
 */


/*********************************************************************
 * LOCAL VARIABLES
 */


/*********************************************************************
 * GLOBAL VARIABLES
 */


/*********************************************************************
 * LOCAL FUNCTIONS
 */


/*********************************************************************
 * GLOBAL FUNCTIONS
 */
/**
 * @brief 初始化SD卡硬件
 *
 * 此函数用于初始化SD卡硬件，为后续的SD卡操作做准备。
 * 调用此函数后，SD卡应该处于可操作状态。
 */
extern void hal_sd_init(void);

/**
 * @brief 获取SD卡的状态
 *
 * 此函数用于获取SD卡的当前状态。
 * 返回值表示SD卡的状态，具体含义由实现决定。
 *
 * @return uint8_t SD卡的状态
 */
extern int hal_sd_get_status(void);


#ifdef __cplusplus
}
#endif

#endif /* __HAL_SD_H__ */
